In [2]:
import pandas as pd
from pathlib import Path

school_path = Path("../Starter_Code/PyCitySchools/Resources/schools_complete.csv")
student_path = Path("../Starter_Code/PyCitySchools/Resources/students_complete.csv")

school_df = pd.read_csv(school_path)
student_df = pd.read_csv(student_path)

complete_df = pd.merge(student_df, school_df, how="left", on="school_name")

complete_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

District Summary

In [3]:
complete_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [4]:
#unique schools

school_count = len(complete_df["school_name"].value_counts())
school_count

15

In [5]:
#number of students

student_count = complete_df["student_name"].count()
student_count

39170

In [6]:
#total budget

total_budget = complete_df["budget"].unique()

sum_total_budget = total_budget.sum()

sum_total_budget

24649428

In [7]:
# average math score

average_math_score = complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [8]:
# average reading score
average_reading_score = complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [9]:
# passing math

passed_math_count = complete_df.loc[complete_df["math_score"] >= 70].count()["student_name"]
#passed_math_count
passed_math_percent = (passed_math_count / student_count) * 100

passed_math_percent

74.9808526933878

In [10]:
# passing reading

passed_reading_count = complete_df.loc[complete_df["reading_score"] >= 70].count()["student_name"]
#passed_reading_count
passed_reading_percent = (passed_reading_count / student_count) * 100

passed_reading_percent

85.80546336482001

In [11]:
# passed both

passed_both_count = complete_df.loc[
    (complete_df["math_score"] >= 70) & (complete_df["reading_score"] >= 70)].count()["student_name"]

#passed_both_count

passed_both_percentage = (passed_both_count / student_count) * 100

passed_both_percentage

65.17232575950983

In [12]:
# DataFrame of district's metric's

district_summary_df = pd.DataFrame([[school_count, student_count, sum_total_budget, 
                                     average_math_score, average_reading_score, 
                                    passed_math_percent, passed_reading_percent,
                                    passed_both_percentage]], columns= ["School Count", "Student Count", "Total Budget", 
                                     "Average Math Score", "Average Reading Score", 
                                    "% Passed Math", "% Passed Reading",
                                    "% Passed Both"])

district_summary_df["Student Count"] = district_summary_df["Student Count"].map("{:,}".format)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)


district_summary_df

,School Count,Student Count,Total Budget,Average Math Score,Average Reading Score,% Passed Math,% Passed Reading,% Passed Both
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

School Summary

In [130]:
# school type

school_types = school_df.set_index(['school_name'])["type"]

school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [135]:
# students per school

per_school_counts = school_df.set_index(["school_name"])["size"]

per_school_counts

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [161]:
# budget per school and per capita

# complete_df['per_capita_budget'] = (complete_df['budget']) / (complete_df ['size'])

# complete_df

# budget_list_types = complete_df.groupby(["school_name"])

# budget_per_capita = budget_list_types[["per_capita_budget"]].max()

# budget_per_school = budget_list_types[["budget"]].max()


# print(budget_per_school)

# print(budget_per_capita)

                       School ID      type  size   budget
school_name
Huang High School              0  District  2917  1910635
Figueroa High School           1  District  2949  1884411
Shelton High School            2   Charter  1761  1056600
Hernandez High School          3  District  4635  3022020
Griffin High School            4   Charter  1468   917500
Wilson High School             5   Charter  2283  1319574
Cabrera High School            6   Charter  1858  1081356
Bailey High School             7  District  4976  3124928
Holden High School             8   Charter   427   248087
Pena High School               9   Charter   962   585858
Wright High School            10   Charter  1800  1049400
Rodriguez High School         11  District  3999  2547363
Johnson High School           12  District  4761  3094650
Ford High School              13  District  2739  1763916
Thomas High School            14   Charter  1635  1043130

In [121]:
# average test scores

list_types = complete_df.loc[complete_df[""]]

per_school_math = list_types[["math_score"]].mean()

per_school_reading = list_types[["reading_score"]].mean()

print(per_school_math)

print(per_school_reading)

                       math_score
school_name
Bailey High School      77.048432
Cabrera High School     83.061895
Figueroa High School    76.711767
Ford High School        77.102592
Griffin High School     83.351499
Hernandez High School   77.289752
Holden High School      83.803279
Huang High School       76.629414
Johnson High School     77.072464
Pena High School        83.839917
Rodriguez High School   76.842711
Shelton High School     83.359455
Thomas High School      83.418349
Wilson High School      83.274201
Wright High School      83.682222
                       reading_score
school_name
Bailey High School         81.033963
Cabrera High School        83.975780
Figueroa High School       81.158020
Ford High School           80.746258
Griffin High School        83.816757
Hernandez High School      80.934412
Holden High School         83.814988
Huang High School          81.182722
Johnson High School        80.966394
Pena High School           84.044699
Rodriguez High School      80.744686
Shelton High School        83.725724
Thomas High School         83.848930
Wilson High School         83.989488
Wright High School         83.955000

In [126]:
# students passing

students_passing_math = complete_df.loc

,School Count,Student Count,Total Budget,Average Math Score,Average Reading Score,% Passed Reading,% Passed Both
% Passed Math,,,,,,,
74.980853,1,1,1,1,1,1,1

In [140]:
per_school_summary = pd.DataFrame({"School Type": school_types,
                                 "Total Students": per_school_counts})
per_school_summary

                      School Type  Total Students
school_name
Huang High School        District            2917
Figueroa High School     District            2949
Shelton High School       Charter            1761
Hernandez High School    District            4635
Griffin High School       Charter            1468
Wilson High School        Charter            2283
Cabrera High School       Charter            1858
Bailey High School       District            4976
Holden High School        Charter             427
Pena High School          Charter             962
Wright High School        Charter            1800
Rodriguez High School    District            3999
Johnson High School      District            4761
Ford High School         District            2739
Thomas High School        Charter            1635

In [119]:
# Use the code provided to separate the data by grade
ninth_graders = complete_df.loc[(complete_df["grade"] == "9th")]
tenth_graders = complete_df.loc[(complete_df["grade"] == "10th")]
eleventh_graders = complete_df.loc[(complete_df["grade"] == "11th")]
twelfth_graders = complete_df.loc[(complete_df["grade"] == "12th")]



# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_group = ninth_graders.groupby(["school_name"])
ninth_grade_math_scores = ninth_grade_math_group[["math_score"]].mean()
#print(ninth_grade_math_scores)


tenth_grade_math_group = tenth_graders.groupby(["school_name"])
tenth_grade_math_scores = tenth_grade_math_group[["math_score"]].mean()
#print(tenth_grade_math_scores)

eleventh_grade_math_group = eleventh_graders.groupby(["school_name"])
eleventh_grade_math_scores = eleventh_grade_math_group[["math_score"]].mean()
#print(eleventh_grade_math_scores) 

twelfth_grade_math_group = twelfth_graders.groupby(["school_name"])
twelfth_grade_math_scores = twelfth_grade_math_group[["math_score"]].mean()
#print(twelfth_grade_math_scores)

# # Combine each of the scores above into single DataFrame called `math_scores_by_grade`
math_scores_by_grade = pd.merge(ninth_grade_math_scores, tenth_grade_math_scores, 
                                 on=["school_name"])



# # Minor data wrangling
# math_scores_by_grade = math_scores_by_grade[["9th", "10th", "11th", "12th"]]
math_scores_by_grade.index.name = None

# # Display the DataFrame
math_scores_by_grade

                       math_score_x  math_score_y
Bailey High School        77.083676     76.996772
Cabrera High School       83.094697     83.154506
Figueroa High School      76.403037     76.539974
Ford High School          77.361345     77.672316
Griffin High School       82.044010     84.229064
Hernandez High School     77.438495     77.337408
Holden High School        83.787402     83.429825
Huang High School         77.027251     75.908735
Johnson High School       77.187857     76.691117
Pena High School          83.625455     83.372000
Rodriguez High School     76.859966     76.612500
Shelton High School       83.420755     82.917411
Thomas High School        83.590022     83.087886
Wilson High School        83.085578     83.724422
Wright High School        83.264706     84.010288